backend/app/Controllers/Auth.php

UPDATE `societies` SET `login_tokens` = '0a11a7db942d022cb1f771a93f0e8cb5'
WHERE `id_card_number` = '20210003'
AND `password` = '121212'
SELECT *
FROM `societies`
WHERE `id_card_number` = '20210003'
AND `password` = '121212'
SELECT *
FROM `regionals`
WHERE `id` = '1'
---
    public function login(){
        $post = $this->request->getPost();
        $id_card_number = $post["id_card_number"];
        $data= [
            "token"=> md5($id_card_number)
        ];
        $password = $post["password"];
        $where = ["id_card_number"=>$id_card_number, "password"=>$password];
        $resp = $this->db->table("societies")->where($where)
                ->get()->getRowArray();

        if($resp){

            // menambahkan token ke societies (update login_tokens)
            $resp["login_tokens"] = md5($id_card_number);
            $this->db->table("societies")->where($where)->update(["login_tokens"=>$resp["login_tokens"]] );

            // mencari data regional berdasarkan regional_id
            $regional = $this->db->table("regionals")->where(["id"=>$resp["regional_id"]])->get()->getRow();

SELECT *
FROM `societies`
WHERE `login_tokens` = '93279e3308bdbbeed946fc965017f67a'
---
    public function logout(){
        $token = $this->request->getGet("token");
        // mengecek apakah token ditemukan
        $data = $this->db->table("societies")->where(["login_tokens"=>$token])
                ->get()->getNumRows();